<details><summary>Show Plan</summary>

```

terraform
module.keystore-docdb.random_password.master_password: Refreshing state... [id=none]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=staging_keyserver]
data.assert_test.workspace: Reading...
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=60]
data.assert_test.workspace: Read complete after 0s
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_keyserver_logs]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/4a2b7414-8a24-4235-aa0f-b5db9efab83c]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-e93280fb-403a-4a6d-ae0b-c24153d81eac]
data.aws_ecr_repository.repository: Reading...
module.keystore-docdb.aws_kms_key.docdb_encryption: Refreshing state... [id=2f0b0120-f9f0-4e73-a032-9b32b9d273c2]
module.ecs.data.aws_ecr_image.service_image: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.keystore-docdb.aws_secretsmanager_secret.master_password: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-jyiAwz]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
data.aws_vpc.vpc: Reading...
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_keyserver_ecs_task_execution_role]
module.ecs.data.aws_ecr_image.service_image: Read complete after 1s [id=sha256:650aad45a93f3027407a5f425b764bc871b4f2016b12ee33879ad9b7d14ad4c0]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=61]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_keyserver_ecs_task_execution_role-20230123165633264200000003]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_keyserver_ecs_task_execution_role-20230123165633263100000002]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_keyserver_ecs_task_execution_role-20230123165633261600000001]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z098781520DYMYC4P6VDC]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_keyserver_cluster]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z098781520DYMYC4P6VDC__d10fe09d59a830b084d8db90d6842763.staging.keys.walletconnect.com._CNAME]
module.keystore-docdb.aws_secretsmanager_secret_version.master_password: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-jyiAwz|0A7600A4-8557-44ED-90EB-E5B26F704FC4]
data.aws_ecr_repository.repository: Read complete after 1s [id=keyserver]
data.aws_vpc.vpc: Read complete after 2s [id=vpc-09dce0b23af575478]
data.aws_subnets.public_subnets: Reading...
module.ecs.aws_security_group.tls_ingess: Refreshing state... [id=sg-0ce39c02220f9baa8]
module.keystore-docdb.aws_security_group.service_security_group: Refreshing state... [id=sg-0a0d7ee9dada4d636]
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-092c47b694fe8b4c8]
data.aws_subnets.private_subnets: Reading...
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-961/990176404ae8dc90]
data.aws_subnets.private_subnets: Read complete after 1s [id=eu-central-1]
module.keystore-docdb.aws_docdb_subnet_group.private_subnets: Refreshing state... [id=staging-keyserver-keystore-docdb-private-subnet-group]
data.aws_subnets.public_subnets: Read complete after 1s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-keyserver-lb-9ae/315e0c74d54136e3]
module.keystore-docdb.aws_docdb_cluster.docdb_primary: Refreshing state... [id=staging-keyserver-keystore-docdb-primary-cluster]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-keyserver-lb-9ae/315e0c74d54136e3/65dac46ed12af85e]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z098781520DYMYC4P6VDC_staging.keys.walletconnect.com_A]
module.keystore-docdb.aws_docdb_cluster_instance.docdb_instances[0]: Refreshing state... [id=staging-keyserver-keystore-docdb-primary-instance-0]
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_keyserver]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"
        name                               = "staging_keyserver-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:9" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:8" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_keyserver" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 8 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

      ~ runtime_platform {
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*